<a href="https://colab.research.google.com/github/TheRiceMan24/Snippets/blob/main/Make_an_SQL_Database.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3
import os
database = 'college.db'
if os.path.exists(database):
    os.remove(database)

sql = '''
BEGIN TRANSACTION;
DROP TABLE IF EXISTS "student";
CREATE TABLE IF NOT EXISTS "student" (
	"StudentID"	INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
	"FirstName"	TEXT,
	"Surname"	TEXT,
	"TutorID"	INTEGER,
	FOREIGN KEY("TutorID") REFERENCES "tutor"("TutorID")
);
DROP TABLE IF EXISTS "tutor";
CREATE TABLE IF NOT EXISTS "tutor" (
	"TutorID"	INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
	"FirstName"	TEXT,
	"Surname"	TEXT
);
INSERT INTO "student" ("StudentID","FirstName","Surname","TutorID") VALUES (1,'FirstName1','LastName1',1),
 (2,'FirstName2','LastName1',2),
 (3,'FirstName3','LastName1',3),
 (4,'FirstName4','LastName1',4);
INSERT INTO "tutor" ("TutorID","FirstName","Surname") VALUES (1,'Teacherfirst1','Teacherlast1'),
 (2,'Teacherfirst2','Teacherlast2'),
 (3,'Teacherfirst3','Teacherlast3');
COMMIT;
'''

con = sqlite3.connect(database)
cur = con.cursor()
cur.executescript(sql)
con.commit()
con.close()